
import pandas as pd

df1 = pd.DataFrame([
    {'姓名': '张三', '语文': 85, '数学': 92, '英语': 78},
    {'姓名': '李四', '语文': 78, '数学': 88, '英语': 95},
    {'姓名': '王五', '语文': 92, '数学': 96, '英语': 89},
    {'姓名': '赵六', '语文': 85, '数学': 90, '英语': 90},
    {'姓名': '孙七', '语文': 72, '数学': 59, '英语': 66},
    {'姓名': '周八', '语文': 80, '数学': 76, '英语': 68},
    {'姓名': '吴九', '语文': 85, '数学': 85, '英语': 85},
    {'姓名': '郑十', '语文': 57, '数学': 68, '英语': 49}
])

print(f"语文成绩最高分{df1['语文'].max()}：，最低分{df1['语文'].min()}，平均分{df1['语文'].mean()}")
print(f"数学成绩最高分:{df1['数学'].max()} , 最低分:{df1['数学'].min()} , 平均分:{df1['数学'].mean()}")
print(f"英语成绩最高分:{df1['英语'].max()} , 最低分:{df1['英语'].min()} , 平均分:{df1['英语'].mean():.1f}")

